//춘식이 키우기 개발 페이지

#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <unistd.h>
void Print(int arr[][25], int size, int i, int j) //춘식이 방& 방 안에 춘식이 구현 함수
{
    for(int i=0; i<25; i++)
    {
        for(int j=0; j<25; j++)
        {
            if(arr[i][j] == 1)
            {
                printf("🍥 ");
            }
            if(arr[i][j] == 0)
            {
                printf("   ");
            }
            if(arr[i][j] == 2)
            {
                printf("😾 ");
            }
        }
        printf("\n");
    }
}
void Move(int arr[][25], int size, double weight, int* x, int* y) // 춘식이 돌아다니는 함수
{
    int i = rand()%19+1;
    int j = rand()%19+1;
    if(weight<15)
    {
        arr[*x][*y] = 0;
        arr[*x][(*y+1)] = 0;
        arr[(*x+1)][*y] = 0;
        arr[(*x+1)][(*y+1)] = 0;
    
        *x=i;
        *y=j;
        arr[*x][*y] = 2;
    }
    else if(weight>=15&&weight<50)
    {
        arr[*x][*y] = 0;
        arr[*x][(*y+1)] = 0;
        arr[(*x+1)][*y] = 0;
        arr[(*x+1)][(*y+1)] = 0;

        *x=i;
        *y=j;
        arr[*x][*y] = 2;
        arr[*x][(*y+1)] = 2;
    }
    else if(weight>=50&&weight<80)
    {
        arr[*x][*y] = 0;
        arr[*x][(*y+1)] = 0;
        arr[(*x+1)][*y] = 0;
        arr[(*x+1)][(*y+1)] = 0;
    
        *x=i;
        *y=j;
        arr[*x][*y] = 2;
        arr[*x][(*y+1)] = 2;
        arr[(*x+1)][*y] = 2;
        arr[(*x+1)][(*y+1)] = 2;
    }
    else if(weight>=80&&weight<=100)
    {
        arr[*x][*y] = 0;
        arr[*x][(*y+1)] = 0;
        arr[*x][(*y+2)] = 0;
        arr[(*x+1)][*y] = 0;
        arr[(*x+2)][*y] = 0;
        arr[(*x+1)][(*y+1)] = 0;
        arr[(*x+1)][(*y+2)] = 0;
        arr[(*x+2)][(*y+1)] = 0;
        arr[(*x+2)][(*y+2)] = 0;
    
        *x=i;
        *y=j;
        arr[*x][*y] = 2;
        arr[*x][(*y+1)] = 2;
        arr[*x][(*y+2)] = 2;
        arr[(*x+1)][*y] = 2;
        arr[(*x+2)][*y] = 2;
        arr[(*x+1)][(*y+1)] = 2;
        arr[(*x+1)][(*y+2)] = 2;
        arr[(*x+2)][(*y+1)] = 2;
        arr[(*x+2)][(*y+2)] = 2;
    }
}

int main(void)
{
    srand((unsigned int)time(NULL));
    double weight=10; // 몸무게
    double love=0; // 애정도
    int count=0; // 턴 횟수 세기
    int i, j, x=12, y=12;

    //배열로 춘식이 방 구현
    int arr[25][25]={
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,2,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
    };

    while(weight<100)
    {
        system("clear");
        Print(arr,25,i,j);
        Move(arr,25,weight, &x,&y);
        printf("%d턴째 : 몸무게🐽 %f, 애정도💕 %f \n", count, weight, love);
        sleep(2);
        love=love+5;
        weight=weight+0.5;
        count++;
        if(count>1)
        {
            if(rand()%2 == 0) // 밥먹으면 50%의 확률로 똥을 쌈(몸무게 -0.2kg)
            {
                weight-=0.2;
            }
            if(rand()%10 == 0) // 10% 확률로 병에 걸림
            {
                system("clear");
                Print(arr,25,i,j);
                Move(arr,25,weight,&x,&y);
                printf("%d턴째 : 몸무게🐽 %f, 애정도💕 %f \n", count, weight, love);
                printf("춘시기가 병에 걸렸습니다🤕 \n");
                sleep(2);
                while(1) // 병에 걸리면 도는 while문
                {
                    system("clear");
                    Print(arr,25,i,j);
                    Move(arr,25,weight,&x,&y);
                    love=love+5;
                    weight -=0.5;
                    double recovery = rand()%100;
                    printf("%d턴째 : 몸무게🐽 %f, 애정도💕 %f \n", count, weight, love); // 병에 걸리고 완치 되기 전
                    printf("현재 병에 걸린 상태🥲 \n");
                    sleep(2);
                    if(recovery<love*0.1) // 병 걸린 춘식이가 회복
                    {
                        system("clear");
                        Print(arr,25,i,j);
                        Move(arr,25,weight,&x,&y);
                        love=love+5;
                        count++;
                        printf("%d턴째 : 몸무게🐽 %f, 애정도💕 %f \n", count, weight, love);
                        printf("완치😻 \n");
                        weight=weight+0.5;
                        sleep(2);
                        break;
                    }
                    if(rand()%20 == 0) // 20% 확률로 춘식이가 죽음
                    {
                        system("clear");
                        Print(arr,25,i,j);
                        Move(arr,25,weight,&x,&y);
                        count++;
                        printf("%d턴째 : 몸무게🐽 %f, 애정도💕 %f \n", count, weight, love);
                        printf("춘시기 쥬금🫥 \n");
                        sleep(2);
                        return 0;
                    }
                }
                count++;
                continue;
            }
        }
    }
    if(weight>=100) // 춘식이가 100kg이 됨
    {
        printf("거대 춘식(이)가 되었다👻");
    }
}
